# Задача 26:  Напишите программу, которая на вход принимает два числа A и B, 
# и возводит число А в целую степень B с помощью рекурсии.

# def grade_count(a, b):
#     if(b>0):
#         return a*grade_count(a, b-1)
#     else: return 1

# num = int(input("Введите число: "))
# grade = int(input("Введите степень: "))

# print(grade_count(num, grade))

# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

# def sum(a, b):
#     if(b>0):
#         return 1+sum(a, b-1)
#     else: return a

# num1 = int(input("Введите число: "))
# num2 = int(input("Введите степень: "))

# print(sum(num1, num2))